tests/performance/load-test-config.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warm-up phase
    - duration: 10
      arrivalRate: 5
      name: "Warm-up"
    # Ramp-up phase
    - duration: 30
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up"  
    # Sustained load phase
    - duration: 60
      arrivalRate: 50
      name: "Sustained load"
    # Peak load phase
    - duration: 30
      arrivalRate: 100
      name: "Peak load"
  processor: "./load-test-functions.js"
  
# Performance benchmarks
expect:
  # Response time requirements (95th percentile)
  p95: 500  # 500ms max for 95% of requests
  p99: 1000 # 1000ms max for 99% of requests
  
  # Error rate requirements
  maxErrorRate: 1  # Max 1% error rate
  
  # Throughput requirements  
  minThroughput: 40  # Min 40 requests/second

scenarios:
  - name: "Health Check Load Test"
    weight: 40
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: "status"
            - equals:
              - "{{ status }}"
              - "healthy"
      - think: 1

  - name: "API Specs Load Test"
    weight: 25
    flow:
      - get:
          url: "/specs"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: "openapi"
      - think: 2

  - name: "OpenAPI Spec Load Test"
    weight: 15
    flow:
      - get:
          url: "/frontend/openapi.json"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: "openapi"
      - think: 3

  - name: "Versions Load Test"  
    weight: 10
    flow:
      - get:
          url: "/versions"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: "version_info"
      - think: 2

  - name: "Individual OpenAPI Files Load Test"
    weight: 10
    flow:
      - get:
          url: "/openapi/backend-frontend-api-v1.yaml"
          expect:
            - statusCode: 200
            - contentType: json
      - get:
          url: "/asyncapi/backend-frontend-events-v1.yaml" 
          expect:
            - statusCode: 200
            - contentType: json
      - get:
          url: "/protobuf/agent_service.proto"
          expect:
            - statusCode: 200
      - think: 5